import { Component } from 'react';
import { BrowserRouter, Link, Router, Redirect } from 'react-router-dom';
import logo from '../res/logo.jpg';
import './Home.css';
import 'mdbreact/dist/css/mdb.css';

class Home extends Component {
  render() {
    return (
      <>
      <div>
        <header className="Home-header">
          <img className="Logo" src={logo} />
        </header>
        <div className="Annoucement">
          <p>สวัสดีค่ะน้องๆ :D ค่ายจุฬาฯ - ชลบุรี ครั้งที่ 42 เปิดรับสมัครแล้วค่า ✌︎</p>
          <p>⚾︎ ค่ายของพวกเราจะจัดขึ้นในวันที่ 5 - 7 กุมภาพันธ์ 2564 เป็นเวลา 2 วัน 1 คืน ณ โรงเรียนXXX จังหวัดชลบุรี</p>
          <p>-  จุดประสงค์ของการจัดกิจกรรมครั้งนี้ คือ เพื่อแนะแนวทางการศึกษาต่อในระดับอุดมศึกษา ให้น้อง ๆ ได้ค้นหาตนเองและสร้างมิตรภาพดี ๆ กับเพื่อน ๆ จากโรงเรียนอื่น ๆ ในจังหวัดชลบุรี</p>
          <p>👥 จำนวนที่รับสมัคร: 150 คน</p>
          <p>🗓 ระยะเวลาการรับสมัคร: วันXXที่ DD MM YYYY เวลา XX.XX น. ถึงวันXXที่ DD MM เวลา XX.XX น.</p>
          <p>แบบฟอร์มที่น้อง ๆ ต้องกรอกจะแบ่งเป็น 3 ส่วน ดังนี้ค่ะ</p>
          <p>- ข้อมูลส่วนตัว</p>
          <p>- ส่วนการตอบคำถาม</p>
          <p>- ส่วนพูดคุยกับพี่ๆ</p>
          <p>✎ แต่ก่อนที่น้องจะได้มาพบประสบการณ์ดี ๆ ในค่ายที่พี่ ๆ ตั้งใจจัดขึ้นมานี้ ก็ต้องมีการคัดเลือกสักเล็กน้อยค่ะ 😆</p>
          <p>คำถามที่จะใช้คัดเลือกมีทั้งหมด 3 ข้อ และในหน้าที่น้องต้องกรอก พี่พิมพ์คำแนะนำในการตอบไว้ให้น้องเพิ่มเติมด้วย น้องอาจจะเข้าไปดูก่อนเขียนคำตอบได้ค่ะ</p>
          <p>เกณฑ์การให้คะแนน:</p>
          <p>-ตอบคำถามครบประเด็น</p>
          <p>-คำตอบอยู่บนพื้นฐานของความจริงความเป็นเหตุและผล</p>
          <p>แล้วพบกันนะคะ :D</p>
        </div>
        <Link to="/register"><button type="button" class="btn btn-primary"><h1>สมัครค่าย</h1></button></Link>
      </div>
      </>
    );
  }
}

export default Home;
